Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/skeivtarkiv.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: One had to consider using the Sterilization Act of 1934, but also compare penis amputation to verdicts on serious injury, done on basis of the Penal Code.
nn: Her måtte ein vurdere å bruke Steriliseringslova av 1934, men også sjå penisamputasjon opp mot avgjerder i Straffelova om grov skade.

source: investigation of how Norwegian doctors, lawyers and the Norwegian Directorate of Health have thought about and treated genuine transvestism / transsexualism in the period 1952–1982.
nn: undersøking av korleis norske legar, juristar og Helsedirektoratet har tenkt om og behandla genuin transvestisme / transseksualisme i perioden 1952–1982.

source: But the former changed his position after learning about patients receiving treatment from other doctors on what he believed to be wrong basis.
nn: Men førstnemnde endra standpunkt etter å ha fått kjennskap til pasientar som fekk gjennomført behandling på det han meinte var feil grunnlag hjå andre legar.

source: The committee submitted a majority recommendation, signed by Per Anchersen, Gabriel Langfeldt and Nils Kinnerøed.
nn: Utvalet leverte ei fleirtalsinnstilling som var underskrive av Per Anchersen, Gabriel Langfeldt og Nils Kinnerøed.

source: I hope this thesis can be helpful in understanding how the Norwegian health authorities have been thinking and why.
nn: Eg meiner, håpar og trur, at oppgåva kan vere til hjelp i å freiste å forstå kva norske helsemyndigheiter har tenkt tidlegare og kvifor.

source: This set in motion experiments on gender, first on animals, but also on humans.
nn: Desse tankane sette i gong forsøk og eksperiment på kjønn, fyrst på dyr, men også på menneske.

source: The director of health also feared that a formalization would draw attention to the procedure and the diagnosis, and that this would generate a large influx of new patients, like after the publicity surrounding Christine Jørgensen.
nn: Helsedirektøren frykta også at ei formalisering ville rette merksemd mot tilbodet og diagnosen, og at dette ville generere ei stor tilstrøyming av nye pasientar, slik ein såg det etter publisiteten kring Christine Jørgensen.

source: There they met patients with problems related to gender identity, some also talked about changing gender.
nn: Der opplevde dei at det kom inn pasientar med problematikk knytt til kjønnsidentitet, enkelte snakka også om ynskje om kjønnsskifte.

source: Bremer believed there was no basis in the research literature for this claim.
nn: Bremer meinte at det ikkje fanst grunnlag i forskingslitteraturen til å hevde dette.

source: In 1977, a counselling service for homosexuals was established at the Oslo Health Council.
nn: I 1977 vart det oppretta ei rådgjevingsteneste for homofile ved Oslo Helseråd.

source: It turned out to be some legal considerations concerning surgical treatment.
nn: For det viste seg at det var nokre juridiske utfordringar også når det gjaldt operativ behandling.

source: The new health director Torbjørn Mork was satisfied with these ad-hoc solutions.
nn: Den nye helsedirektøren Torbjørn Mork var tilfreds med desse ad-hoc løysingane.

source: The majority believed there was enough evidence to say the patients would have a better life after surgery and adaptation in a new gender role, and that this could then be recommended after careful assessment and consideration in each case.
nn: Fleirtalet meinte det var bevis nok til stades for at pasientane fekk det betre med operasjon og tilpassing i ei ny kjønnsrolle, og at dette då kunne anbefalast etter nøye vurdering og utgreiing.

source: In 1953, health director Karl Evang set up an expert committee, consisting of some of the country's leading psychiatrists, to decide whether to treat genuine transvestism, as it was then called, and eventually how.
nn: I 1953 sette helsedirektør Karl Evang ned eit sakkyndig utval, som bestod av nokre av landets fremste psykiatrar, for å utgreie om ein skulle behandle genuin transvestisme, som det då vart kalla, og eventuelt korleis.

source: Jørgensen was a guinea pig in a study on sex hormones, and his research results were ground breaking.
nn: Jørgensen vart ein forsøkskanin i ein studie om kjønnshormon, og forskingsresultatet av denne var banebrytande.

source: After the change was completed, and after it could be confirmed that the person was no longer fertile, one could get a new gender status and choose a more gender-specific name.
nn: Etter at skiftet var gjennomført, og etter at det kunne bekreftast at personen ikkje lenger var fertil kunne ein få eit ny kjønnsstatus og velje eit meir kjønnsspesifikt namn.

source: In 1953, there was a question whether procedures such as castration and amputation of the penis were legal in general.
nn: I 1953 var det eit spørsmål om inngrep som kastrasjon og amputasjon av penis var lovlege i det heile.

source: In many ways it can be said it all starts with new theories about gender.
nn: På mange måtar kan ein seie at det heile byrja med nye teoriar om kjønn.

source: Previously there has been no historical research on transsexualism in Norway.
nn: Det har tidlegare ikkje blitt forska historisk på transseksualisme i Noreg.

source: After reading the committee's recommendation and Bremers dissent, health director Evang took Bremers standpoint, and sought further legal considerations.
nn: Etter å ha lest utvalet si innstilling og dissensen til Bremer, stilte helsedirektør Evang seg bak mindretalet og gjekk inn for vidare juridisk utgreiing av spørsmålet.

source: Based on a disagreement around whether to recommend surgical treatment, Johan Bremer dissented.
nn: Med bakgrunn i ueinigheit om ein kunne tilrå operativ behandling eller ikkje, tok Johan Bremer ut dissens.
